БукмекерскаяКонтора/src/Documents/РезультатыМероприятия/РезультатыМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РезультатыМероприятия</name>
  <registerRecords>AccumulationRegister.Депозиты</registerRecords>
  <attributes>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Исходы</name>
    <attributes>
      <name>Исход</name>
      <type>
        <types>CatalogRef.Исходы</types>
      </type>
    </attributes>
    <attributes>
      <name>Верный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БукмекерскаяКонтора/src/Documents/РезультатыМероприятия/Forms/Записать/Module.bsl
&НаКлиенте
Процедура МероприятиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	МероприятиеОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура МероприятиеОбработкаВыбораНаСервере(Мероприятие)
	Запрос = новый Запрос;
	Запрос.Текст = "Выбрать
	|	Исходы.Ссылка как Исход,
	|	Ложь как Верный
	|из 
	|	Справочник.Исходы как Исходы
	|где
	|	Мероприятие = &Мероприятие";
	Запрос.УстановитьПараметр("Мероприятие", Мероприятие);
	Исход = Запрос.Выполнить().Выбрать();

	Объект.Исходы.Очистить();
	Пока Исход.Следующий() Цикл
		Сообщить(Исход.Исход);
		Строка = Объект.Исходы.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Исход);
	КонецЦикла;

КонецПроцедуры
